/* Пар који даје највећи XOR
време	меморија	улаз	излаз	тест примери
1 s	64 Mb	стандардни излаз	стандардни улаз	
Напиши програм који међу унетим природним бројевима одређује онај пар 
који даје највећи резултат при операцији ексклузивне дисјункције (xor).

Улаз
Са стандардног улаза се уноси број n (1≤n≤100000), а затим n природних бројева између 0 i 10 na 18, сваки у посебном реду.

Излаз
На стандардни излаз исписати максималну вредност која се може добити 
када се операција ексклузивне дисјункције примени на нека два унета броја.

Пример
Улаз
5
1
2
3
4
5
Излаз
7
Објашњење
Највећи резултат 7 добија се ексклузивном дисјункцијом бројева 3 и 4 
(њихови бинарни записи су 00...0000011 и 000...000100). 
Исти резултат добија се и ексклузивном дисјункцијом бројева 2 и 5 
(њихови бинарни записи су 0000..0000101 и 0000...00000010).

Решење грубом силом подразумева да се на сваки пар бројева примени операција XOR 
и да се испише максимум добијених резултата. Сложеност овог приступа је O(n2).


 */

#include <iostream>
#include <vector>
using namespace std;

typedef unsigned long long ull;

int main() {
    int n;
    cin >> n;
    vector<ull> brojevi(n);
    for (int i = 0; i < n; i++)
        cin >> brojevi[i];
    ull max = 0;
    for (int i = 1; i < n; i++)
        for (int j = 0; j < i; j++)
        if ((brojevi[i] ^ brojevi[j]) > max)
            max = brojevi[i] ^ brojevi[j];
    cout << max << endl;
    return 0;
}